website.org
#+TITLE: Personal Website
#+DATE: July 17, 2018
#+AUTHOR: Colin McLear

*** DONE Moving to Hugo                                                       :hugo:pelican:website:
CLOSED: [2018-07-19 Thu 10:49]
:PROPERTIES:
:EXPORT_FILE_NAME: moving-to-hugo
:END:

Another summer, another excuse to tinker with my wesbite. I've used [[https://blog.getpelican.com][pelican]], a
python [[https://en.wikipedia.org/wiki/Web_template_system#Static_site_generators][static site generator]], to run this website for nearly six years. It's a
great tool. But I dislike python [[https://en.wikipedia.org/wiki/Dependency_hell][dependency hell]], and pelican is a bit slow.
So I've looked elsewhere. [[https://gohugo.io][Hugo]] is blazing fast, has a thriving community,
decent templates, and a downloadable binary that you can get via [[https://brew.sh][homebrew]]. No
more dependency management! Also important for me (as an [[https://www.gnu.org/software/emacs/][emacs]] user), there is
a great [[https://orgmode.org][org-mode]] exporter---[[https://ox-hugo.netlify.com][ox-hugo]]---that lets me easily generate the web
content from an org-file. On the whole I've been very happy with the move.

I've also changed hosting from github to [[https://netlify.com][Netlify]], which provides dead-simple
hosting. All you do is point it at a git repository (which remains on [[https://github.com/mclearc][Github]])
and tell it what commands to run and it provides continuous deployment. So
whenever I make a change to the site and push that change to [[https://github.com/mclearc/colinmclear.net][my repository]] on
Github Netlify automatically regenerates the site. Very cool.  



